RubyOnRails/ecommerce/app/controllers/api/category_controller.rb

SELECT COUNT(*) FROM "categories"
---
  def index
    @all_category = Category.all.search(params[:q])
    @category = @all_category.paginate(:page => params[:page] ? params[:page] : 1, :per_page => params[:row_per_page] ? params[:row_per_page] : Rails.application.config.no_of_row_per_page)

INSERT INTO "categories" ("name", "is_deleted", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tooth paste"], ["is_deleted", 0], ["created_at", "2021-02-16 05:33:03.107919"], ["updated_at", "2021-02-16 05:33:03.107919"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Oil"], ["updated_at", "2021-02-15 13:06:58.654059"], ["id", 2]]
---
  def destroy
    if @category.present?
      @category.is_deleted = true
      if @category.save

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "fruits "], ["updated_at", "2021-02-15 13:34:32.653319"], ["id", 5]]
---
  def update
    if @category.present?
      if @category.update(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_category
    @category = Category.find_by(:id => params[:id])