RubyOnRails/ecommerce/app/controllers/api/customer_controller.rb

INSERT INTO "customers" ("name", "email", "gender", "contact_no", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Rengaraj"], ["email", "rengaraj@calibriant.com"], ["gender", 1], ["contact_no", "8015838576"], ["created_at", "2021-02-16 12:55:19.001495"], ["updated_at", "2021-02-16 12:55:19.001495"]]
---
  def create
    @customer = Customer.new(customer_params)
    if @customer.save

UPDATE "customers" SET "is_deleted" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_deleted", 1], ["updated_at", "2021-02-16 13:06:10.381584"], ["id", 2]]
---
  def destroy
    if @customer.present?
      @customer.is_deleted = true
      if @customer.save